Tekla.Structures.Drawing.IAxisAlignedBoundingBox
The IAxisAlignedBoundingBox interface is implemented by objects that have an axis aligned bounding box.

Tekla.Structures.Drawing.IAxisAlignedBoundingBox.GetAxisAlignedBoundingBox
Gets the bounding box for the current object in the global axis coordinate system.
Returns: A rectangle bounding box for the current object.